In [1]:
# import package in steps and initialize a data frame "df"

import pandas as pd
import pkg.modify.apnd as p1
import pkg.modify.dlt as p2
import pkg.query.dob as p3
import pkg.query.qry as p4

df = pd.DataFrame(columns=["eno","ename","age","salary"])
print(df)

Empty DataFrame
Columns: [eno, ename, age, salary]
Index: []

In [2]:
# Input the list of employee number, employee names, age and salary into a list called data
data = [["1265","John",23,50000],["4598","Sara",45,85000],["2360","Bob",65,120000],["1839","Julia",21,55000],["7632","Mike",52,150000]]
print(data)

[['1265', 'John', 23, 50000], ['4598', 'Sara', 45, 85000], ['2360', 'Bob', 65, 120000], ['1839', 'Julia', 21, 55000], ['7632', 'Mike', 52, 150000]]

In [3]:
# Run the addat function to append the list of data into the data frame.

df = p1.addat(df,data)
print(df[["eno","ename","age","salary"]])

    eno  ename   age    salary
0  1265   John  23.0   50000.0
1  4598   Sara  45.0   85000.0
2  2360    Bob  65.0  120000.0
3  1839  Julia  21.0   55000.0
4  7632   Mike  52.0  150000.0

In [4]:
# Execute the deldat funtion to delete a particular row based on employee number.

data = "1839"

df = p2.deldat(df,data)
print(df[["eno","ename","age","salary"]])

Employee exists
    eno ename   age    salary
0  1265  John  23.0   50000.0
1  4598  Sara  45.0   85000.0
2  2360   Bob  65.0  120000.0
3  7632  Mike  52.0  150000.0

In [5]:
# Employ function dob to execute an inheretence module by assigning the date of birth to an employee number.

empl = p3.dob("2360","08/18/1996")
empl.display()

Employee No: 2360
Date of Birth: 08/18/1996

In [6]:
# Use count function to eastablish number of records and run the fltr function based on the following criteria : 
# Enter upper and lower limits on age of employee followed by upper and lower limits on salary.


print("Data Frame has {} employee records".format(p4.count(df)))

agel = raw_input("Enter the lower limit on age:")
ageu = raw_input("Enter the upper limit on age:")
sall = raw_input("Enter the lower limit on salary:")
salu = raw_input("Enter the upper limit on salary:")

print("")
print("Employees matching entered criteria:")
print("")
p4.fltr(df,agel,ageu,sall,salu)

Data Frame has 4 employee records
Enter the lower limit on age:25
Enter the upper limit on age:65
Enter the lower limit on salary:45000
Enter the upper limit on salary:120000

Employees matching entered criteria:

    eno ename   age   salary
1  4598  Sara  45.0  85000.0